travel_text = {

    "0": {
        name: "Tutorial: Easy Reader",
        description: "New to the game? Learn to play against a few easy enemies before moving on to a more difficult book."
    },

	"1": {
		name: "Chapter 1: Among the cabbages",
		description: "Lex finds himself in the idyllic garden of a countryside cottage. Several furry critters have come to partake in its juicy cabbages, including... a cat wearing clothes?",
	    lex_pos: [90,210]
    },
	
	"2": {
		name: "Chapter 2: Sherwood Forest",
		description: "Eager to leave the perilous patch of cabbages, Lex hurries down a well-trodden path through the woods. Unfortunately, his journey is instantly impeded by hostile highway hooligans.",
        lex_pos: [120,330],
        advice: "If I were me, I'd prepare for tile steal and bleed."
    },

    "3": {
        name: "Chapter 3: The Worm's Tale",
        description: "After escaping from the perilous wood, Lex catches sight of a homely inn beside the road. Hoping for hospitality, Lex finds instead a motley crew of rowdy travellers of all social standings...",
        lex_pos: [150,440],
        advice: "If I were me, I'd prepare for tile smash."
    },

    "4": {
        name: "Chapter 4: A Stranger Neck of the Woods",
        description: "Lex wriggles away from the hurly-burly and back into the forest, quickly realizing that he has entered a much stranger neck of the woods. Things will only get weirder from here on.",
        lex_pos: [280,490],
        advice: "If I were me, I'd prepare for tile alter."
    },

    "5": {
        name: "Chapter 5: Pirate Harbor",
        description: "Emerging from his surreal experience in the woods as if from a dream, Lex approaches a picturesque beach hugging a tranquil lagoon. That is, tranquil until Lex is suddenly attacked by scurvy-infested pirates and fearsome fauna.",
        lex_pos: [400, 500],
        advice: "If I were me, I'd prepare for tile smash, bleed, and heavy damage."
    },

    "8": {
        name: "Chapter 8: Sir Gawain and the Green Worm"
    }

}
